Courses/7140/Lectures/Homeworks/7140-homework-2-2013-fall.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Fall 2013: Home Work 2</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Fall 2013: Home Work 2"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-11-06T03:03-0500"/>
<meta name="author" content="Prabhaker Mateti"/>
<meta name="description" content="CS7140 Software Engineering Lecture"/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../Lectures"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div>

<div id="preamble">
<a href="../../Top/">CS 7140 Advanced Software Engineering</a>
</div>

<div id="content">
<h1 class="title">Fall 2013: Home Work 2</h1>

<p>Home work in this course is done individually, without help from
others.  The due date is announced on the course home page.
</p>
<p>
We will be using the SmallSet.java (<a href="../Lectures/FormalMethods/SmallSet.java">Java Source</a>, <a href="../Lectures/FormalMethods/SmallSet.java.html">htmlized</a>, <a href="../Lectures/FormalMethods/SmallSet.java.pdf">pdf</a>) file
in a couple of the items below.  You are welcome to use <i>your</i> version
of SmallSet.java instead.
</p>
<ol>
<li>(25 points) [Literate Programming] Express SmallSet.Java as a
   literate program (LP).  The LP version should exemplify the OOP
   design by contract principles.  Recall that an LP author presents
   it in an order that suits the explanation of the program to fellow
   software engineers, not necessarily in the order that a compiler
   may expect it.

<p>
   You may use any of the LP tools: <a href="http://www.cs.tufts.edu/~nr/noweb/">noweb</a>, <a href="http://nuweb.sourceforge.net/">nuweb</a>, cweb, <a href="http://wiki.eclipse.org/Intent">intent</a>, <a href="http://lep.sourceforge.net/">lep</a>
   (Eclipse plugin), <a href="https://code.google.com/p/nano-lp/">nano-lp</a>, &hellip;; some of these are ready to <code>apt-get    install</code> packages in Debian/Ubuntu distros.  Visit
   <a href="http://www.literateprogramming.com/">http://www.literateprogramming.com/</a> for further details.  Professor
   Emeritus Donald Knuth, "fastest pen in the West", Turing Award
   Winner 1974, developer of the <a href="http://en.wikipedia.org/wiki/TeX">TeX</a> typesetting system, has several
   example programs at
   <a href="http://www-cs-faculty.stanford.edu/~knuth/programs.html">http://www-cs-faculty.stanford.edu/~knuth/programs.html</a> to read.
   His "Programming Pearls, Literate Programming: The Common Words
   Problem", <a href="http://www2.ece.ohio-state.edu/~fasiha/Papers/CommACM-Programming-Pearls-Knuth-Bentley-v29-n5-1986.pdf">PDF</a>, 1986 was a Required Reading weeks ago.
</p>
</li>
<li>(25 points) [JML] This part of the home work is focussed on gaining
   experience with the use of JML.  Thoroughly document SmallSet.Java
   using JML assertions (i.e., invariant, requires, ensures,
   assignable, &hellip;).  Recall that we want the weakest <code>requires</code>, and
   the strongest <code>ensures</code> and invariants.

<p>
   Use a JML Plugin (in Eclipse, or Intellij Idea) or a command line
   JML tool to runtime assertion check (RAC) the SmallSet.Java.  There
   are several JML plugins that you can discover through a web search;
   e.g., <a href="http://jmlspecs.sourceforge.net/openjml-updatesite">http://jmlspecs.sourceforge.net/openjml-updatesite</a> It is
   useful to this class if you all try different JML plugins and
   report on your experience.
</p>
</li>
<li>(25 points) [JUnit or TestNG] This part of the home work is
   focussed on systematic testing.  You are welcome to use any two
   BlueJ class files, non-trivial, and intersting-to-you, as test
   targets.  Members of a team must select different classes.  You are
   welcome to include the results of this Homework2 in the Testing and
   Debugging Report of the course project.

<p>
   Use a JUnit Plugin or a TestNG plugin (in Eclipse, or Intellij
   Idea).  The latest versions of these IDE already have these test
   plugins installed.
</p>
</li>
<li>(25 points) [FindBugs Plugin] This part of the home work is
   focussed on gaining experience with the use of a static analysis of
   source code tool named <a href="http://findbugs.sourceforge.net/">FindBugs</a>. See also,
   <a href="http://plugins.jetbrains.com/plugin/?id=3847">http://plugins. jetbrains. com/ plugin/ ?id=3847</a>.  You are welcome
   to use any two BlueJ class files, non-trivial, and
   intersting-to-you, as targets.  Members of a team must select
   different classes.  Examine closely the reports produced by the
   FindBugs tool.  Which of the items do you agree with?  How did you
   resolve it?

</li>
<li>(00 points) Please maintain a journal for this homework.  Submit a
   summary.
</li>
</ol>


<p>
This <code>Homework2</code> is now complete. 
Turn in your answers on <code>gandalf.cs.wright.edu</code> as in
  <code>~pmateti/cs7140/turnin Homework2 hw2.pdf tarBallName</code> Include the
  source code files into the tar-ball.  Other than the source code
  files, put <b>everything else</b>, including diagrams, screen shots,
  together and produce one .pdf file.
</p>
</div>

<div id="postamble">
<hr size=1>Copyright &copy; 2013 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a>
</div>
</body>
</html>
